app/Controllers/Produk.php

    public function detail($seo)
    {
        // Ambil data produk berdasarkan SEO/Slug
        $produk = $this->produkModel->getDetailBySeo($seo);

        // Jika produk tidak ditemukan (misal url salah ketik)
        if (empty($produk)) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Produk tidak ditemukan: ' . $seo);
        }

        // (Opsional) Ambil Produk Terkait (Produk dalam kategori yang sama)
        $terkait = $this->produkModel->where('id_kategori_produk', $produk['id_kategori_produk'])
                                     ->where('id_produk !=', $produk['id_produk']) // Jangan tampilkan produk yang sedang dibuka
                                     ->orderBy('waktu_input', 'DESC')
                                     ->findAll(4);
---
SELECT *
FROM `rb_produk`
WHERE `id_kategori_produk` = '1'
AND `id_produk` != '1'
ORDER BY `waktu_input` DESC
 LIMIT 4