app/Models/BeritaModel.php

    public function getBeritaTerbaru($limit = 5)
    {
        return $this->select('tb_berita.*, tb_kategori.nama_kategori')
                    ->join('tb_kategori', 'tb_kategori.id_kategori = tb_berita.id_kategori', 'left')
                    ->where('status', 'Y') // Hanya yang status publish (Y)
                    ->orderBy('id_berita', 'DESC')
                    ->findAll($limit);
---
SELECT `tb_berita`.*, `tb_kategori`.`nama_kategori`
FROM `tb_berita`
LEFT JOIN `tb_kategori` ON `tb_kategori`.`id_kategori` = `tb_berita`.`id_kategori`
WHERE `status` = 'Y'
ORDER BY `id_berita` DESC
 LIMIT 3

    public function getHeadline()
    {
        return $this->select('tb_berita.*, tb_kategori.nama_kategori')
                    ->join('tb_kategori', 'tb_kategori.id_kategori = tb_berita.id_kategori', 'left')
                    ->where('headline', 'Y')
                    ->where('status', 'Y')
                    ->orderBy('id_berita', 'DESC')
                    ->findAll(); // Bisa findAll() atau first() tergantung desain slider kamu
---
SELECT `tb_berita`.*, `tb_kategori`.`nama_kategori`
FROM `tb_berita`
LEFT JOIN `tb_kategori` ON `tb_kategori`.`id_kategori` = `tb_berita`.`id_kategori`
WHERE `headline` = 'Y'
AND `status` = 'Y'
ORDER BY `id_berita` DESC