app/Models/KonsumenModel.php

SELECT *
FROM `rb_konsumen`
WHERE   (
`username` = 'dharma'
OR `email` = 'dharma'
 )
 LIMIT 1
---
    public function cekLogin($userOrEmail, $password)
    {
        // Cari data berdasarkan username ATAU email
        $konsumen = $this->groupStart()
                         ->where('username', $userOrEmail)
                         ->orWhere('email', $userOrEmail)
                         ->groupEnd()
                         ->first();