app/Models/ProdukModel.php

SELECT `rb_produk`.*, `rb_kategori_produk`.`nama_kategori`
FROM `rb_produk`
LEFT JOIN `rb_kategori_produk` ON `rb_kategori_produk`.`id_kategori_produk` = `rb_produk`.`id_kategori_produk`
ORDER BY `rb_produk`.`waktu_input` DESC
---
    public function getProdukLengkap()
    {
        return $this->select('rb_produk.*, rb_kategori_produk.nama_kategori')
                    ->join('rb_kategori_produk', 'rb_kategori_produk.id_kategori_produk = rb_produk.id_kategori_produk', 'left')
                    ->orderBy('rb_produk.waktu_input', 'DESC')
                    ->findAll();

SELECT `rb_produk`.*, `rb_kategori_produk`.`nama_kategori`
FROM `rb_produk`
LEFT JOIN `rb_kategori_produk` ON `rb_kategori_produk`.`id_kategori_produk` = `rb_produk`.`id_kategori_produk`
WHERE `rb_produk`.`produk_seo` = 'kemeja-flannel-kotak'
 LIMIT 1
---
    public function getDetailBySeo($seo)
    {
        return $this->select('rb_produk.*, rb_kategori_produk.nama_kategori')
                    ->join('rb_kategori_produk', 'rb_kategori_produk.id_kategori_produk = rb_produk.id_kategori_produk', 'left')
                    ->where('rb_produk.produk_seo', $seo)
                    ->first();

SELECT `rb_produk`.*, `rb_kategori_produk`.`nama_kategori`
FROM `rb_produk`
LEFT JOIN `rb_kategori_produk` ON `rb_kategori_produk`.`id_kategori_produk` = `rb_produk`.`id_kategori_produk`
ORDER BY `waktu_input` DESC
 LIMIT 6
---
    public function getProdukTerbaru($limit = 6)
    {
        return $this->select('rb_produk.*, rb_kategori_produk.nama_kategori')
                    ->join('rb_kategori_produk', 'rb_kategori_produk.id_kategori_produk = rb_produk.id_kategori_produk', 'left')
                    ->orderBy('waktu_input', 'DESC')
                    ->findAll($limit);