app/Models/UserModel.php

    public function cekLogin($username, $password)
    {
        // 1. Cari user berdasarkan username
        $user = $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'dharma'
 LIMIT 1